# FabricationPartBrowser Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePanes..::..BuiltInDockablePanes..::..FabricationPartBrowser Property
DockablePanes..::..BuiltInDockablePanes Class See Also
---
The Fabrication part browser pane.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static DockablePaneId FabricationPartBrowser { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartBrowser As DockablePaneId
	Get
```

Visual C++
---
```text
public:
static property DockablePaneId^ FabricationPartBrowser {
	DockablePaneId^ get ();
}
```

# See Also
DockablePanes..::..BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace